visual-studio-setup.tex
% Created 2015-01-22 Thu 13:19
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{array}
\usepackage{color}
\providecommand{\alert}[1]{\textbf{#1}}

\title{CSci 515 Setting Up Visual Studio Express 2010}
\author{}
\date{Spring 2015}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Setting Up Visual Studio Express 2010},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle


\section*{Line Numbers}
\label{sec-1}


I prefer to always have line numbers enabled in my source code editor
as most compiler errors/warnings refer to specific line numbers in the
source file, and thus it is easier to quicly determine the potential
location of problems if line numbers are visible.  For Visual Studio
Express 2010 you can enable line numbers like this:

\begin{enumerate}
\item Tools $\rightarrow$ Options
\item In Options Dialog, select Text Editor $\rightarrow$ C/C++ $\rightarrow$ General
\item Enable the Line Numbers checkbox
\end{enumerate}

\end{document}
